docs/modules/file-tools/freemacs-sunrise.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-07 Thu 17:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sunrise Commander Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../init.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Sunrise Commander Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd99b53b">Do Not Lock Windows</a></li>
</ul>
</li>
<li><a href="#orge43eaa6">End</a></div>
</div>
<p>
<a href="https://github.com/sunrise-commander/sunrise-commander">Sunrise Commander</a> is a two-pane orthodox file manager similar to Midnight Commander.
</p>



<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">sunrise-commander</span>
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>sr-windows-locked nil<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #1ea8fc;">)</span>
</pre>
</div>

<div id="outline-container-orgd99b53b" class="outline-3">
<h3 id="orgd99b53b">Do Not Lock Windows</h3>
<div class="outline-text-3" id="text-orgd99b53b">
<p>
Sunrise Commander locks the windows vertically by default. The following line will customize this so that the panes can be resized if wanted.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>sr-windows-locked nil<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge43eaa6" class="outline-2">
<h2 id="orge43eaa6">End</h2>
<div class="outline-text-2" id="text-orge43eaa6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-sunrise</span><span style="color: #1ea8fc;">)</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">freemacs-sunrise.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Time-stamp: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-07 Thu 15:24&gt;</span></span></p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 17:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
